app/controllers/expense_reports_controller.rb

  def index
    result_null_expense_reports = ExpenseReport.all.where(vote_result: nil).where("vote_deadline <= ?", DateTime.now)
    result_null_expense_reports.each do |expense_report|
---
SELECT `expense_reports`.* FROM `expense_reports` WHERE `expense_reports`.`vote_result` IS NULL AND (vote_deadline <= '2017-09-08 02:33:14.631587')
SELECT `expense_reports`.* FROM `expense_reports`